taylorcouette2/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
 top
    {
	type 		zeroGradient;
    }

    bottom
    {
		type 		zeroGradient;
    }

    rotatingWall
    {
	
	type 		zeroGradient;
    }
    wall
    {
	type 		zeroGradient;
    }
    frontAndBack
    {
        type            empty;
    }
edges
    {
        type            zeroGradient;
    }

/*
    top
    {
	type 		fixedValue;
	value 		uniform	101;
    }

    bottom
    {
	type 		fixedFluxPressure;
    }

    rotatingWall
    {
	
	type 		zeroGradient;
    }
    wall
    {
	type 		fixedFluxPressure;
    }
    frontAndBack
    {
        type            empty;
    }
*/
}

// ************************************************************************* //
