taylorcouette2/0/shearRate
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      shearRate;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 0.0;

boundaryField
{
     top
    {
        type            symmetryPlane;
    }
    bottom
    {
        type            symmetryPlane;
    }
    rotatingWall
    {
	
	type 		zeroGradient;
    }
    wall
    {
	type 		zeroGradient;
    }
    frontAndBack
    {
        type            empty;
    }
}
// ************************************************************************* //
